903257958/stm32_oop_driver/usart_dma/driver/usart.c
	return 0;
}

/******************************************************************************
 * @brief	printf重定义（仅USART1可用）
 ******************************************************************************/
int fputc(int ch, FILE *f)
{
	USART_SendData(USART1, ch);	// 写DR寄存器
	while (RESET == USART_GetFlagStatus(USART1, USART_FLAG_TXE));	// 等待TXE置1，不需要手动清除标志位
	return ch;
}

/******************************************************************************
 * @brief	printf函数封装（多个串口都可使用）
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __usart_printf(USARTDev_t *pDev, char *format, ...)
{
	if (!pDev || !pDev->initFlag)
		return -1;
	
	char str[100];
	va_list arg;
	va_start(arg, format);
	vsprintf(str, format, arg);
	va_end(arg);
	__usart_send_string(pDev, str);
	
	return 0;
}

/******************************************************************************
 * @brief	返回USART接收的一个字节
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	USART接收的一个字节
 ******************************************************************************/
static uint8_t __usart_recv_byte(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = pDev->pPrivData;
	
	return gRxByte[pPrivData->index];
}

/******************************************************************************
 * @brief	获取USART接收一个字节标志位（并自动清除）
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	USART接收一个字节标志位
 ******************************************************************************/
static uint8_t __usart_recv_byte_flag(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = pDev->pPrivData;
	
	if (gRxByteFlag[pPrivData->index] == 1)
	{
		gRxByteFlag[pPrivData->index] = 0;
		return 1;
	}
	return 0;
}

/******************************************************************************
 * @brief	返回USART接收的文本数据包的首地址
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	USART接收的文本数据包的首地址
 ******************************************************************************/
static char *__usart_recv_string(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = pDev->pPrivData;
	
	if (!pDev->DMAFlag)
	{
		return gRxString[pPrivData->index];
	}
	else
	{
		return pPrivData->rxStringDMA;
	}
}

/******************************************************************************
 * @brief	返回USART接收的文本数据包标志位（并自动清除）
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	USART接收的文本数据包标志位
 ******************************************************************************/
static uint8_t __usart_recv_string_flag(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = pDev->pPrivData;
	
	if (gRxStringFlag[pPrivData->index] == 1)
	{
		gRxStringFlag[pPrivData->index] = 0;
		
		return 1;
	}
	return 0;
}

/******************************************************************************
 * @brief	返回USART接收的HEX数据包的首地址
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	USART接收的HEX数据包的首地址
 ******************************************************************************/
static uint8_t *__usart_recv_hex_packet(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = pDev->pPrivData;
	
	return gRxHexPacket[pPrivData->index];
}

/******************************************************************************
 * @brief	返回USART接收的HEX数据包标志位（并自动清除）
 * @param	pDev	:  USARTDev_t结构体指针
 * @return	USART接收的HEX数据包标志位
 ******************************************************************************/
static uint8_t __usart_recv_hex_packet_flag(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = pDev->pPrivData;
	
	if (gRxHexPacketFlag[pPrivData->index] == 1)
	{
		gRxHexPacketFlag[pPrivData->index] = 0;
		return 1;
	}
	return 0;
}

/******************************************************************************
 * @brief	去初始化USART
 * @param	pDev   :  USARTDev_t
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
static int __usart_deinit(USARTDev_t *pDev)
{
	USARTPrivData_t *pPrivData = pDev->pPrivData;

	if (!pDev || !pDev->initFlag)
		return -1;
	
	/* 释放私有数据内存 */
	free(pPrivData->rxStringDMA);
	free(pDev->pPrivData);
    pDev->pPrivData = NULL;
	
	pDev->DMAFlag = false;	// 修改初始化标志
	pDev->initFlag = false;
	
	return 0;
}

/******************************************************************************
 * @brief	USART接收一个字节中断回调函数
 * @param	usartx	：	串口外设
 * @return	无
 ******************************************************************************/
static void __usart_recv_byte_callback(USARTx usartx)
{
	uint8_t index;
	if (usartx == USART1)		{index = 0;}
	else if (usartx == USART2)	{index = 1;}
	else if (usartx == USART3)	{index = 2;}
	else if (usartx == UART4)	{index = 3;}
	else if (usartx == UART5)	{index = 4;}
	#if defined(STM32F40_41xxx)
	else if (usartx == USART6)	{index = 5;}
	#endif
	
	gRxByte[index] = USART_ReceiveData(usartx);
	gRxByteFlag[index] = 1;
}

/******************************************************************************
 * @brief	USART接收文本数据包中断回调函数
 * @param	usartx	：	串口外设
 * @return	无
 ******************************************************************************/
static void __usart_recv_string_callback(USARTx usartx)
{
	uint8_t index;
	if (usartx == USART1)		{index = 0;}
	else if (usartx == USART2)	{index = 1;}
	else if (usartx == USART3)	{index = 2;}
	else if (usartx == UART4)	{index = 3;}
	else if (usartx == UART5)	{index = 4;}
	#if defined(STM32F40_41xxx)
	else if (usartx == USART6)	{index = 5;}
	#endif
	
	static uint8_t rx_string_num = 0; 						// 接收到文本数据包的数据个数
	
	uint8_t rx_byte = USART_ReceiveData(usartx);
	
	if (rx_string_num < (sizeof(gRxString[index]) - 1)) 	// 确保不越界
	{
		gRxString[index][rx_string_num++] = rx_byte;
		if (rx_byte == '\n' && rx_string_num > 1 && gRxString[index][rx_string_num - 2] == '\r')	// 检查是否接收到完整的数据包
		{
			gRxString[index][rx_string_num - 2] = '\0';	// 结束符
			rx_string_num = 0; 							// 重置接收计数器
			gRxStringFlag[index] = 1; 					// 标记数据包已接收完成
		}
	}
	else
	{
		rx_string_num = 0;								// 如果接收到的数据超出了数组的大小，重置接收计数器
		gRxStringFlag[index] = 0;
	}
}

/******************************************************************************
 * @brief	USART接收HEX数据包中断回调函数
 * @param	usartx	：	串口外设
 * @param	head	：	要接收的HEX数据包头
 * @param	end		：	要接收的HEX数据包尾
 * @return	无
 ******************************************************************************/
static void __usart_recv_hex_packet_callback(USARTx usartx, uint8_t head, uint8_t end)
{
	uint8_t index;
	if (usartx == USART1)		{index = 0;}
	else if (usartx == USART2)	{index = 1;}
	else if (usartx == USART3)	{index = 2;}
	else if (usartx == UART4)	{index = 3;}
	else if (usartx == UART5)	{index = 4;}
	#if defined(STM32F40_41xxx)
	else if (usartx == USART6)	{index = 5;}
	#endif
	
