903257958/stm32_oop_driver/usart_dma/driver/usart.c
	static uint8_t rx_state = 0;			// 状态变量
	static uint8_t rx_hex_packet_num = 0;	// 接收到HEX数据包的数据个数
	
	uint8_t rx_byte = USART_ReceiveData(usartx);
	
	if (rx_state == 0)
	{
		if (rx_byte == head)	// 收到包头
		{
			rx_state = 1;
			rx_hex_packet_num = 0;
		}
	}
	else if (rx_state == 1)
	{
		gRxHexPacket[index][rx_hex_packet_num++] = rx_byte;
		if (rx_hex_packet_num >= RX_HEX_PACKET_LENGTH)
		{
			rx_state = 2;
		}
	}
	else if (rx_state == 2)
	{
		if (rx_byte == end)	// 收到包尾
		{
			rx_state = 0;
			gRxHexPacketFlag[index] = 1;
		}
	}
}

/******************************************************************************
 * @brief	USART1中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void USART1_IRQHandler(void)
{
	volatile uint8_t clear;
	
	
	if (USART_GetITStatus(USART1, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = USART1->SR;			// 清除空闲中断
			clear = USART1->DR;			// 清除空闲中断
			gRxStringFlag[0] = 1;		// 置接收标志位
		
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
			DMA_Cmd(DMA1_Channel5, DISABLE);
			#elif defined(STM32F40_41xxx)
			DMA_Cmd(DMA2_Stream5, DISABLE);
			#endif
	}
	
	if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET)
	{
		__usart_recv_byte_callback(USART1);
		__usart_recv_string_callback(USART1);
		__usart_recv_hex_packet_callback(USART1, 0x24, 0xFF);

		USART_ClearITPendingBit(USART1, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
 * @brief	USART2中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void USART2_IRQHandler(void)
{
	volatile uint8_t clear;
	
	if (USART_GetITStatus(USART2, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = USART2->SR;		// 清除空闲中断
			clear = USART2->DR;		// 清除空闲中断
			gRxStringFlag[1] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
			DMA_Cmd(DMA1_Channel6, DISABLE);
			#elif defined(STM32F40_41xxx)
			DMA_Cmd(DMA1_Stream5, DISABLE);
			#endif
	}

	if (USART_GetITStatus(USART2, USART_IT_RXNE) == SET)
	{
		__usart_recv_byte_callback(USART2);
		__usart_recv_string_callback(USART2);
		__usart_recv_hex_packet_callback(USART2, 0x24, 0xFF);

		USART_ClearITPendingBit(USART2, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
 * @brief	USART3中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void USART3_IRQHandler(void)
{
	volatile uint8_t clear;

	if (USART_GetITStatus(USART3, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = USART3->SR;		// 清除空闲中断
			clear = USART3->DR;		// 清除空闲中断
			gRxStringFlag[2] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
			DMA_Cmd(DMA1_Channel3, DISABLE);
			#elif defined(STM32F40_41xxx)
			DMA_Cmd(DMA1_Stream1, DISABLE);
			#endif
	}

	if (USART_GetITStatus(USART3, USART_IT_RXNE) == SET)
	{
		__usart_recv_byte_callback(USART3);
		__usart_recv_string_callback(USART3);
		__usart_recv_hex_packet_callback(USART3, 0x24, 0xFF);

		USART_ClearITPendingBit(USART3, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
 * @brief	UART4中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void UART4_IRQHandler(void)
{
	volatile uint8_t clear;

	if (USART_GetITStatus(UART4, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = UART4->SR;		// 清除空闲中断
			clear = UART4->DR;		// 清除空闲中断
			gRxStringFlag[3] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
			DMA_Cmd(DMA2_Channel3, DISABLE);
			#elif defined(STM32F40_41xxx)
			DMA_Cmd(DMA1_Stream2, DISABLE);
			#endif
	}

	if (USART_GetITStatus(UART4, USART_IT_RXNE) == SET)
	{
		__usart_recv_byte_callback(UART4);
		__usart_recv_string_callback(UART4);
		__usart_recv_hex_packet_callback(UART4, 0x24, 0xFF);

		USART_ClearITPendingBit(UART4, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
* @brief	UART5中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void UART5_IRQHandler(void)
{
	#if defined(STM32F40_41xxx)
	volatile uint8_t clear;

	if (USART_GetITStatus(UART5, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = UART5->SR;		// 清除空闲中断
			clear = UART5->DR;		// 清除空闲中断
			gRxStringFlag[4] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			DMA_Cmd(DMA1_Stream0, DISABLE);
	}
	#endif
	
	if (USART_GetITStatus(UART5, USART_IT_RXNE) == SET)
	{
		__usart_recv_byte_callback(UART5);
		__usart_recv_string_callback(UART5);
		__usart_recv_hex_packet_callback(UART5, 0x24, 0xFF);

		USART_ClearITPendingBit(UART5, USART_IT_RXNE);	// 清除中断标志位
	}
}

/******************************************************************************
* @brief	UART6中断函数
 * @param	无
 * @return	无
 ******************************************************************************/
void USART6_IRQHandler(void)
{
	#if defined(STM32F40_41xxx)
	volatile uint8_t clear;

	if (USART_GetITStatus(USART6, USART_IT_IDLE) != RESET)   // 空闲中断
	{
			clear = USART6->SR;		// 清除空闲中断
			clear = USART6->DR;		// 清除空闲中断
			gRxStringFlag[5] = 1;	// 置接收标志位
			
			/* 空闲中断产生，关闭DMA，等待数据处理，在调用 dma_recv_enable 函数后DMA才被重新开启 */
			DMA_Cmd(DMA1_Stream1, DISABLE);
	}
	
	if (USART_GetITStatus(USART6, USART_IT_RXNE) == SET)
	{
		__usart_recv_byte_callback(USART6);
		__usart_recv_string_callback(USART6);
		__usart_recv_hex_packet_callback(USART6, 0x24, 0xFF);

		USART_ClearITPendingBit(USART6, USART_IT_RXNE);	// 清除中断标志位
	}
	#endif
}
